backend/app/Controllers/Admin/CetakRaporController.php

    public function index()
    {
        $this->data['title'] = 'Cetak Rapor Siswa';
        $this->data['color'] = $this->getColor();

        // 1. Ambil Tahun Ajaran (Dinamis dari GET atau Aktif)
        $id_ta_get = $this->request->getGet('ta');
        if ($id_ta_get) {
            $ta_aktif = $this->db->table('tahun_ajaran')->where('id', $id_ta_get)->get()->getRowArray();
        } else {
            $ta_aktif = $this->db->table('tahun_ajaran')->where('status', 'Aktif')->get()->getRowArray();
---
SELECT *
FROM `tahun_ajaran`
WHERE `status` = 'Aktif'

    public function getSiswaByRombel()
    {
        $rombel_id = $this->request->getGet('rombel_id');
        $id_ta_get = $this->request->getGet('ta');

        if (!$rombel_id) return $this->response->setJSON(['status' => 'error']);

        if ($id_ta_get) {
            $ta_aktif = $this->db->table('tahun_ajaran')->where('id', $id_ta_get)->get()->getRowArray();
        } else {
            $ta_aktif = $this->db->table('tahun_ajaran')->where('status', 'Aktif')->get()->getRowArray();
        }
        $id_ta = $ta_aktif ? $ta_aktif['id'] : 0;
        $semester = $ta_aktif ? $ta_aktif['semester'] : 'Ganjil';

        $builder = $this->db->table('anggota_rombel ar')
            ->select('siswa.id, siswa.nama_lengkap, siswa.nis')
            ->join('siswa', 'siswa.id = ar.siswa_id')
            ->where('ar.rombel_id', $rombel_id)
            ->where('ar.tahun_ajaran_id', $id_ta)
            ->where('ar.semester', $semester);

        if ($this->db->fieldExists('status_siswa', 'siswa')) {
            $builder->where('siswa.status_siswa', 'Aktif');
        }

        $siswa = $builder->orderBy('siswa.nama_lengkap', 'ASC')->get()->getResultArray();
        $validasi = $this->validasiModel->where('rombel_id', $rombel_id)->first();

        $wali_kelas_nama = 'Belum Diatur';
        $rombel = $this->db->table('rombel')->where('id', $rombel_id)->get()->getRowArray();
---
SELECT *
FROM `tahun_ajaran`
WHERE `status` = 'Aktif'
SELECT `siswa`.*, `rombel`.`nama_rombel`, `rombel`.`tingkat`, `guru_tendik`.`nama_lengkap` as `wali_kelas`, `guru_tendik`.`nuptk` as `wali_nuptk`
FROM `siswa`
JOIN `rombel` ON `rombel`.`id` = `siswa`.`rombel_id`
LEFT JOIN `guru_tendik` ON `guru_tendik`.`id` = `rombel`.`wali_kelas_id`
WHERE `siswa`.`id` = '117'

    public function getCatatanSiswa()
    {
        try {
            $siswa_id = $this->request->getGet('siswa_id');
            $id_ta_get = $this->request->getGet('ta');

            if ($id_ta_get) {
                $ta_aktif = $this->db->table('tahun_ajaran')->where('id', $id_ta_get)->get()->getRowArray();
            } else {
                $ta_aktif = $this->db->table('tahun_ajaran')->where('status', 'Aktif')->get()->getRowArray();
            }

            $fTA_TA   = $this->db->fieldExists('tahun', 'tahun_ajaran') ? 'tahun' : 'tahun_ajaran';
            $tahun    = $ta_aktif ? $ta_aktif[$fTA_TA] : '';
            $semester = $ta_aktif ? $ta_aktif['semester'] : '';
            $id_ta    = $ta_aktif ? $ta_aktif['id'] : 0;

            $fTA_Catatan = $this->db->fieldExists('tahun_ajaran_id', 'catatan_rapor') ? 'tahun_ajaran_id' : 'tahun_ajaran';
            $catatan = $this->db->table('catatan_rapor')
                ->where('siswa_id', $siswa_id)
                ->where($fTA_Catatan, ($fTA_Catatan === 'tahun_ajaran_id' ? $id_ta : $tahun))
                ->where('semester', $semester)
                ->get()->getRowArray();
---
SELECT *
FROM `catatan_rapor`
WHERE `siswa_id` = '117'
AND `tahun_ajaran` = '2025/2026'
AND `semester` = 'Genap'