backend/app/Controllers/Admin/KurikulumController.php

SELECT *
FROM `kurikulum`
SELECT *
FROM `kurikulum`
WHERE `status` = 'Aktif'
 LIMIT 1
---
    public function index(): string
    {
        // Ambil semua data kurikulum dari database
        $daftarKurikulum = $this->kurikulumModel->findAll();

        // Ambil data kurikulum yang statusnya AKTIF
        $activeKurikulum = $this->kurikulumModel->where('status', 'Aktif')->first();