backend/app/Controllers/Admin/SiswaController.php

    public function getRombel()
    {
        $db = \Config\Database::connect();
        $data = $db->table('rombel')
            ->select('id, nama_rombel, tingkat')
            ->orderBy('tingkat', 'ASC')
            ->orderBy('nama_rombel', 'ASC')
            ->get()->getResultArray();
---
SELECT `id`, `nama_rombel`, `tingkat`
FROM `rombel`
ORDER BY `tingkat` ASC, `nama_rombel` ASC