backend/app/Controllers/Auth/LoginController.php

SELECT *
FROM `audit_logs`
WHERE `action` = 'UPDATE_PERMISSION'
AND  `description` LIKE '%Role ID: 2%' ESCAPE '!'
AND `id` > 0
---
    public function checkRbacUpdate()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON(['reload' => false]);
        }

        $role_id = session()->get('role_id');
        $clientLastId = (int) $this->request->getGet('last_id');
        $db = \Config\Database::connect();

        $newUpdate = $db->table('audit_logs')
            ->where('action', 'UPDATE_PERMISSION')
            ->like('description', 'Role ID: ' . $role_id)
            ->where('id >', $clientLastId)
            ->get()
            ->getRowArray();