backend/app/Models/NotifikasiModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifikasi`
WHERE `user_id` = '38'
AND `is_read` = 0
---
    public function countUnread($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();

SELECT *
FROM `notifikasi`
WHERE `user_id` = '38'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getLatest($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll($limit);