backend/app/Controllers/OrangTua/AkunSayaController.php

SELECT *
FROM `users`
WHERE `id` = '38'
SELECT *
FROM `orangtua_wali`
WHERE `user_id` = '38'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $userId = session()->get('user_id') ?? session()->get('id');

        // 1. AMBIL DATA DARI MASING-MASING TABEL
        $userRaw = $db->table('users')->where('id', $userId)->get()->getRowArray() ?: [];

        $ortuRaw = [];
        if ($db->tableExists('orangtua_wali')) {
            $ortuRaw = $db->table('orangtua_wali')->where('user_id', $userId)->get()->getRowArray() ?: [];

SELECT `roles`.`role_name`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '38'
---
        // 2. AMBIL DATA MULTI-ROLE
        $semua_role = [];
        if ($db->tableExists('user_roles') && $db->tableExists('roles')) {
            $semua_role = $db->table('user_roles')
                ->select('roles.role_name')
                ->join('roles', 'roles.id = user_roles.role_id')
                ->where('user_roles.user_id', $userId)
                ->get()
                ->getResultArray();

SELECT *
FROM `login_logs`
WHERE `user_id` = '38'
ORDER BY `created_at` DESC
 LIMIT 5
---
        $login_logs = [];
        if ($db->tableExists('login_logs')) {
            // Kita tembak langsung tabel login_logs sesuai dengan database
            $raw_logs = $db->table('login_logs')
                ->where('user_id', $userId)
                ->orderBy('created_at', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();

SELECT *
FROM `user_preferences`
WHERE `user_id` = '38'
---
        // 4. AMBIL PREFERENSI TEMA
        $prefs = ['theme' => session()->get('theme') ?? 'light', 'bahasa' => session()->get('bahasa') ?? 'id'];
        if ($db->tableExists('user_preferences')) {
            $prefDb = $db->table('user_preferences')->where('user_id', $userId)->get()->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `user_preferences`
WHERE `user_id` = '38'
UPDATE `user_preferences` SET `theme` = 'dark', `bahasa` = 'ar'
WHERE `user_id` = '38'
---
    public function updatePreferences()
    {
        if (!$this->request->isAJAX()) return $this->response->setStatusCode(403);
        $theme  = $this->request->getPost('theme');
        $bahasa = $this->request->getPost('bahasa');
        $userId = session()->get('user_id') ?? session()->get('id');
        session()->set(['theme' => $theme, 'bahasa' => $bahasa]);

        try {
            $db = \Config\Database::connect();
            if ($db->tableExists('user_preferences')) {
                $cek = $db->table('user_preferences')->where('user_id', $userId)->countAllResults();
                if ($cek > 0) $db->table('user_preferences')->where('user_id', $userId)->update(['theme' => $theme, 'bahasa' => $bahasa]);

SELECT `warna_primary`, `warna_secondary`
FROM `sekolah`
---
    protected function getColor()
    {
        try {
            $db = \Config\Database::connect();
            $colorData = $db->table('sekolah')->select('warna_primary, warna_secondary')->get()->getRowArray();