backend/app/Controllers/GuruMapel/NilaiRaporController.php

SELECT *
FROM `setting_bobot_nilai`
SELECT *
FROM `setting_aturan_nilai`
ORDER BY `nilai_max` DESC
SELECT *
FROM `tahun_ajaran`
WHERE `id` = '9'
SELECT `s`.`id` as `siswa_id`, `s`.`nama_lengkap` as `nama_siswa`, `s`.`nisn`, `nr`.`nilai_akhir`, `nr`.`predikat`
FROM `anggota_rombel` `ar`
JOIN `siswa` `s` ON `s`.`id` = `ar`.`siswa_id`
LEFT JOIN `nilai_rapor` `nr` ON `nr`.`siswa_id` = `s`.`id` AND `nr`.`mapel_id` = 6 AND `nr`.`tahun_ajaran_id` = 9 AND `nr`.`kategori` = 'Tengah Semester'
WHERE `ar`.`rombel_id` = '18'
AND `ar`.`tahun_ajaran_id` = '9'
AND `ar`.`semester` = 'Genap'
AND `s`.`status_siswa` = 'Aktif'
ORDER BY `s`.`nama_lengkap` ASC
SELECT *
FROM `nilai_formatif`
WHERE `mapel_id` = '6'
AND `tahun_ajaran_id` = '9'
AND   (
`kategori` = 'Tengah Semester'
OR `kategori` = 'Tengah'
OR `kategori` = ''
OR `kategori` IS NULL
 )
---
    public function getData()
    {
        $ta_id     = $this->request->getPost('tahun_ajaran_id');
        $rombel_id = $this->request->getPost('rombel_id');
        $mapel_id  = $this->request->getPost('mapel_id');
        $kategori  = $this->request->getPost('kategori');

        if (empty($ta_id) || empty($rombel_id) || empty($mapel_id) || empty($kategori)) {
            return $this->response->setJSON([]);
        }

        $db = \Config\Database::connect();

        // --- 1. AMBIL ATURAN BOBOT DARI DATABASE ---
        $queryBobot = $db->table('setting_bobot_nilai')->get()->getResultArray();
        $bobot = [
            'tengah_semester' => ['nh' => 35, 'uh' => 35, 'sts' => 30],
            'akhir_semester'  => ['nh' => 30, 'uh' => 30, 'sts' => 15, 'sas' => 25]
        ];
        foreach ($queryBobot as $row) {
            if (isset($bobot[$row['kategori']][$row['sub_kategori']])) {
                $bobot[$row['kategori']][$row['sub_kategori']] = (float)$row['bobot'];
            }
        }

        // --- 2. AMBIL ATURAN PREDIKAT DARI DATABASE ---
        $aturanPredikat = $db->table('setting_aturan_nilai')->orderBy('nilai_max', 'DESC')->get()->getResultArray();

        // 🚀 MENGGUNAKAN MESIN WAKTU
        $ta_info = $db->table('tahun_ajaran')->where('id', $ta_id)->get()->getRowArray();
        $semester = $ta_info ? $ta_info['semester'] : 'Ganjil';

        $data_siswa = $db->table('anggota_rombel ar')
            ->select('s.id as siswa_id, s.nama_lengkap as nama_siswa, s.nisn, nr.nilai_akhir, nr.predikat')
            ->join('siswa s', 's.id = ar.siswa_id')
            ->join('nilai_rapor nr', "nr.siswa_id = s.id AND nr.mapel_id = {$mapel_id} AND nr.tahun_ajaran_id = {$ta_id} AND nr.kategori = '{$kategori}'", 'left')
            ->where('ar.rombel_id', $rombel_id)
            ->where('ar.tahun_ajaran_id', $ta_id)
            ->where('ar.semester', $semester)
            ->where('s.status_siswa', 'Aktif')
            ->orderBy('s.nama_lengkap', 'ASC')
            ->get()->getResultArray();

        $formatifs = $db->table('nilai_formatif')
            ->where(['mapel_id' => $mapel_id, 'tahun_ajaran_id' => $ta_id, 'kategori' => $kategori])
            ->get()->getResultArray();