backend/app/Controllers/AdminBaseController.php

SELECT `warna_primary`, `warna_secondary`
FROM `sekolah`
---
    protected function getColor()
    {
        $uri = service('uri');

        $currentSegment = 'dashboard';
        if ($uri->getTotalSegments() >= 2) {
            $currentSegment = $uri->getSegment(2);
        }

        // --- BYPASS CACHE: Langsung tembak ke Database agar warna selalu Fresh! ---
        $db = \Config\Database::connect();
        $sekolahData = $db->table('sekolah')->select('warna_primary, warna_secondary')->get()->getRowArray();