backend/app/Filters/LanguangeFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        // 1. Kita tangkap semua kemungkinan nama session yang biasa dipakai untuk bahasa
        $locale = $session->get('lang') ?? $session->get('locale') ?? $session->get('language') ?? $session->get('bahasa');

        // 2. Jika di session tidak ada, coba ambil dari Database User Preference
        if (!$locale) {
            $userId = $session->get('id') ?? $session->get('user_id');
            if ($userId) {
                $db = \Config\Database::connect();
                $prefs = $db->table('user_preferences')->where('user_id', $userId)->get()->getRowArray();
---
SELECT *
FROM `user_preferences`
WHERE `user_id` = '123'