backend/app/Views/layout/main.php

        function closeMobileSidebar() {
            const sidebar = document.getElementById('sidebar');
            const overlay = document.getElementById('sidebar-overlay');
            if (sidebar) {
                sidebar.classList.remove('translate-x-0', 'mobile-open');
                sidebar.classList.add('-translate-x-full');
            }
            if (overlay) overlay.classList.remove('active');
            document.body.style.overflow = '';
        }
    </script>

    <?php if (session()->get('isLoggedIn')): ?>
        <?php
        // Ambil ID Audit Log Hak Akses TERAKHIR saat halaman ini dimuat
        $dbRadar = \Config\Database::connect();
        $role_id_radar = session()->get('role_id');
        $initLog = $dbRadar->table('audit_logs')
            ->where('action', 'UPDATE_PERMISSION')
            ->like('description', 'Role ID: ' . $role_id_radar)
            ->orderBy('id', 'DESC')
            ->get()->getRowArray();
---
SELECT *
FROM `audit_logs`
WHERE `action` = 'UPDATE_PERMISSION'
AND  `description` LIKE '%Role ID: 5%' ESCAPE '!'
ORDER BY `id` DESC