backend/app/Views/layout/navbar.php

$sekolah = function_exists('get_identitas_sekolah') ? get_identitas_sekolah() : [];

$db = \Config\Database::connect();
$ta_aktif = $db->table('tahun_ajaran')->where('status', 'Aktif')->get()->getRowArray();
---
SELECT *
FROM `tahun_ajaran`
WHERE `status` = 'Aktif'

    // KHUSUS ADMIN atau jika profil di atas tidak ditemukan
    if (empty($namaUser)) {
        // Ambil semua data dari tabel users (tanpa dibatasi select username saja)
        $profil = $db->table('users')->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '38'