backend/app/Views/layout/sidebar.php

SELECT *
FROM `sekolah`
---
// PERBAIKAN: Tarik data langsung dari database (Bypass Helper)
$db = \Config\Database::connect();
// Pastikan nama tabel di bawah ini sesuai dengan di databasemu (misal: identitas_sekolah)
$sekolahData = $db->table('sekolah')->get()->getRowArray() ?? [];